<h1 style="font-size: 2.5em;">Seleksi baris pada Data Frame dengan query</h1>

<h1 style="font-size: 1.6em;">Import Modules</h1>

In [4]:
import pandas as pd

print(pd.__version__)

2.2.2

<h1 style="font-size: 1.6em;">Persiapan Data Frame</h1>

In [7]:
d = {'kolom_satu':[1, 2, 3, 4, 5],
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

<h1 style="font-size: 1.6em;">Seleksi baris dengan query()</h1>

In [10]:
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [12]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50